testing/load/artillery_ws.yaml
config:
  target: "ws://127.0.0.1:4000"
  phases:
    - duration: 60
      arrivalRate: 100
    - duration: 120
      arrivalRate: 500
    - duration: 60
      arrivalRate: 0
engines:
  socketio: {}
scenarios:
  - name: "WebSocket Load Test"
    weight: 100
    engine: "socketio"
    flow:
      - emit:
          channel: "joinChat"
          data: "chat-{{ $randomInt(1, 10) }}"
      - think: 1
      - emit:
          channel: "sendMessage"
          data:
            chatId: "chat-{{ $randomInt(1, 10) }}"
            message:
              senderId: "user-{{ $randomInt(1, 100) }}"
              text: "WebSocket load test {{ $timestamp }}"
              timestamp: "{{ $isoTimestamp }}"
      - on:
          event: "newMessage"
          then:
            - log: "Message received successfully"